eisup_2019_docmng_integration/src/InformationRegisters/ttk_ОКПД2/ttk_ОКПД2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_ОКПД2</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Раздел</name>
    <comment>Латинская прописная буква</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <comment>Две цифры</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкласс</name>
    <comment>Одна цифра</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <comment>Одна цифра</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подгруппа</name>
    <comment>Одна цифра</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <comment>Одна цифра</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <comment>Две цифры и 0</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <comment>Одна цифра</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Включает</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключает</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗагрузки</name>
    <type>
      <types>CatalogRef.ttk_ИсточникиДанныхДляЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписи</name>
    <type>
      <types>EnumRef.ttk_ТипыЗаписейКлассификаторов</types>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <comment>Код действует. (не запись, а код)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоДобавил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоИзменил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_ОКПД2/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	//= Заполняем системные поля.
	для каждого лТекЗапись из ЭтотОбъект цикл
		лТекДата = ТекущаяДата();
		если НЕ ЗначениеЗаполнено(лТекЗапись.КтоДобавил) тогда 
			лТекЗапись.КтоДобавил = "@@"; //глЗначениеПеременной("глТекущийПользователь");
			лТекЗапись.ДатаДобавления = лТекДата;
		конецЕсли;
		лТекЗапись.КтоИзменил = "@@"; //глЗначениеПеременной("глТекущийПользователь");
		лТекЗапись.ДатаИзменения = лТекДата;
	конецЦикла;
КонецПроцедуры
